
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Комментарий") Тогда
		ТекстДоРедактирования 	= Параметры.Комментарий;
		ВведенныйТекст 			= ТекстДоРедактирования;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗначениеЗаполнено(ВведенныйТекст) Тогда
		СтруктураПараметров = Новый Структура("ТекстПосле", ВведенныйТекст);
		СтруктураПараметров.Вставить("ТекстДо", ТекстДоРедактирования);
		ОповеститьОВыборе(СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЖирный(Команда)
	ВведенныйТекст = ВведенныйТекст + "<b>" + ВведенныйТекст + "</b>"; 
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазрывСтроки(Команда)
	ВведенныйТекст = ВведенныйТекст + "<b>";
КонецПроцедуры

&НаКлиенте
Процедура КомандаКурсив(Команда)
	ВведенныйТекст = ВведенныйТекст + "<i>" + ВведенныйТекст + "</i>"; 
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеречеркнутый(Команда)
	ВведенныйТекст = ВведенныйТекст + "<s>" + ВведенныйТекст + "</s>"; 
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодчеркнутый(Команда)
	ВведенныйТекст = ВведенныйТекст + "<u>" + ВведенныйТекст + "</u>"; 
КонецПроцедуры

#КонецОбласти
