
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗначениеЗаполнено(ВведенныйТекст) Тогда
		СтруктураПараметров = Новый Структура("ВведенныйТекст, Тэг, НомерСтроки, Якорь", ВведенныйТекст, Тег, НомерСтроки, Якорь);
		ОповеститьОВыборе(СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Комментарий") Тогда
		ВведенныйТекст = Параметры.Комментарий;
	КонецЕсли;

	Если Параметры.Свойство("Тэг") Тогда
		Тег = Параметры.Тэг;
	КонецЕсли;
	
	Если Параметры.Свойство("НомерСтроки") Тогда
		НомерСтроки = Параметры.НомерСтроки;
	КонецЕсли;

	Если Параметры.Свойство("Якорь") Тогда
		НомерСтроки = Параметры.Якорь; //
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
