
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Комментарий") Тогда
		ТекстДоРедактирования 	= Параметры.Комментарий;
		ВведенныйТекст 			= ТекстДоРедактирования;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗначениеЗаполнено(ВведенныйТекст) Тогда
		СтруктураПараметров = Новый Структура("ТекстПосле", ВведенныйТекст);
		СтруктураПараметров.Вставить("ТекстДо", ТекстДоРедактирования);
		ОповеститьОВыборе(СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЖирный(Команда)
	ВведенныйТекст = ОбщийHTMLКлиент.КомандаЖирный(ВведенныйТекст); 
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазрывСтроки(Команда)
	ВведенныйТекст = ОбщийHTMLКлиент.КомандаРазрывСтроки(ВведенныйТекст)
КонецПроцедуры

&НаКлиенте
Процедура КомандаКурсив(Команда)
	ВведенныйТекст = ОбщийHTMLКлиент.КомандаКурсив(ВведенныйТекст);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеречеркнутый(Команда)
	ВведенныйТекст = ОбщийHTMLКлиент.КомандаПеречеркнутый(ВведенныйТекст); 
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодчеркнутый(Команда)
	ВведенныйТекст = ОбщийHTMLКлиент.КомандаПодчеркнутый(ВведенныйТекст);
КонецПроцедуры

#КонецОбласти
