
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗначениеЗаполнено(ВведенныйТекст) Тогда
		СтруктураПараметров = Новый Структура("ВведенныйТекст, Тэг, НомерСтроки, Якорь", ВведенныйТекст, Тег, НомерСтроки, Якорь);
		ОповеститьОВыборе(СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Комментарий") Тогда
		ВведенныйТекст = Параметры.Комментарий;
	КонецЕсли;

	Если Параметры.Свойство("Тэг") Тогда
		Тег = Параметры.Тэг;
	КонецЕсли;
	
	Если Параметры.Свойство("НомерСтроки") Тогда
		НомерСтроки = Параметры.НомерСтроки;
	КонецЕсли;

	Если Параметры.Свойство("Якорь") Тогда
		Якорь = Параметры.Якорь; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Тег) Тогда
		Тег = Справочники.Тэги.НайтиПоКоду("000000007");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаЖирный(Команда)
	ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;
	ВыделенныйТекстЗамена = "<b>" + ВыделенныйТекст + "</b>";
	ВведенныйТекст = СтрЗаменить(ВведенныйТекст, ВыделенныйТекст, ВыделенныйТекстЗамена); 
КонецПроцедуры


//ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;