
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаСохранить(Команда)
	Расширение = "jpg";

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКаталогаСохраненияФайла", ЭтотОбъект);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.ПолноеИмяФайла 	= Объект.Наименование;
	ДиалогОткрытияФайла.Расширение 		= Расширение;
	ДиалогОткрытияФайла.Заголовок 		= "Укажите каталог для сохранения файла";
	ДиалогОткрытияФайла.Показать(Оповещение);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПослеВыбораКаталогаСохраненияФайла(КаталогВыбор) Экспорт
    
    Если КаталогВыбор = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если КаталогВыбор.Количество()=0 Тогда
        Возврат;
    КонецЕсли;
    
    ИмяФайла = КаталогВыбор[0];
    
    ДвДанные= СсылкаНаДвоичныеДанныеФайла();
    
    Попытка
        ДвДанные.Записать(ИмяФайла);
        ПоказатьПредупреждение(,"Файл записан!");
    Исключение
        ПоказатьПредупреждение(,"Ошибка: " + ОписаниеОшибки() + ", записи файла. Файл не записан!");    
    КонецПопытки;
    
КонецПроцедуры

&НаСервере
Функция СсылкаНаДвоичныеДанныеФайла()
	  
  Возврат Объект.Ссылка.ФайлХранилище.Получить();
  
КонецФункции
#КонецОбласти