#Область СлужебныеПроцедурыИФункции

Функция КомандаЖирный(ВведенныйТекст) Экспорт
	ВведенныйТекст = "<b>" + ВведенныйТекст + "</b>"; 
	Возврат ВведенныйТекст;	 
КонецФункции

Функция КомандаКурсив(ВведенныйТекст) Экспорт
	ВведенныйТекст = "<i>" + ВведенныйТекст + "</i>"; 
	Возврат ВведенныйТекст;	 
КонецФункции

Функция КомандаПеречеркнутый(ВведенныйТекст) Экспорт
	ВведенныйТекст = "<s>" + ВведенныйТекст + "</s>"; 
	Возврат ВведенныйТекст;	 
КонецФункции

Функция КомандаПодчеркнутый(ВведенныйТекст) Экспорт
	ВведенныйТекст = "<u>" + ВведенныйТекст + "</u>"; 
	Возврат ВведенныйТекст;	 
КонецФункции

Функция КомандаРазрывСтроки(ВведенныйТекст) Экспорт
	ВведенныйТекст = ВведенныйТекст + "<br>";
	Возврат ВведенныйТекст;	 
КонецФункции

#КонецОбласти