
&НаКлиенте
Процедура ОписаниеФорматированныйТекстПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ПозицияНачала 		= 0;
    ПозицияОкончания 	= 0; 
    
    Элементы.ОписаниеФорматированныйТекст.ПолучитьГраницыВыделения(ПозицияНачала, ПозицияОкончания);
    ВыделенныйТекст = ОписаниеФорматированныйТекст.ПолучитьТекст(ПозицияНачала, ПозицияОкончания);
    
    Если Не ВыделенныйТекст = "" Тогда
    	ОписаниеФорматированныйТекст.Удалить(ПозицияНачала, ПозицияОкончания); 
		ОписаниеФорматированныйТекст.Вставить(ПозицияНачала, "ССС"); 
    КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОписаниеФорматированныйТекст=ТекущийОбъект.ОписаниеХранилищеФорматированногоТекста.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ОписаниеХранилищеФорматированногоТекста=Новый ХранилищеЗначения(ОписаниеФорматированныйТекст);
	ТекущийОбъект.Описание=ОписаниеФорматированныйТекст.ПолучитьТекст();
КонецПроцедуры

