
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	НоваяСтрока = Объект.Комментарии.Добавить();
	НоваяСтрока.Коментарий 	= ВыбранноеЗначение.ВведенныйТекст;
	НоваяСтрока.Тэг 		= ВыбранноеЗначение.Тег;
	
	КоличествоСтрок = Объект.Комментарии.Количество();
	Объект.Комментарии.Сдвинуть(КоличествоСтрок - 1, -1);	
	
	СформироватьОсновнойТекст();
	
	Модифицированность = Истина;
КонецПроцедуры

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 	Если Объект.Комментарии.Количество() = 0 Тогда
 		ДобавитьНачальнуюСтраницуHTML();	
 	КонецЕсли;	
 	
 	СформироватьОсновнойТекст();
 КонецПроцедуры

#КонецОбласти
 
 #Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаВвестиТекст(Команда)
	ОткрытьФорму("Справочник.Ленты.Форма.ФормаВводаТекста",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	ДобавитьФайлы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 &НаСервере
Процедура СформироватьОсновнойТекст()
	Объект.ОсновнойТекст = "";
	Для Каждого СтрокаТЧ Из Объект.Комментарии Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Тэг) Тогда
			//@skip-check reading-attribute-from-database
			Если СтрокаТЧ.Тэг.Одиночный Тогда
				ТекстДляВставки = "<" + СтрокаТЧ.Тэг.Наименование + ">" +  СтрокаТЧ.Коментарий;
			Иначе
				ТекстДляВставки = "<" + СтрокаТЧ.Тэг.Наименование + ">" + СтрокаТЧ.Коментарий + "</" + СтрокаТЧ.Тэг.Наименование + ">";
			КонецЕсли;	
			ТекстДляВставки = СтрЗаменить(ТекстДляВставки, Символы.ПС, "<br>");
			Объект.ОсновнойТекст = Объект.ОсновнойТекст + ТекстДляВставки;
		Иначе
			Объект.ОсновнойТекст = Объект.ОсновнойТекст + СтрокаТЧ.Коментарий;
		КонецЕсли;
 	КонецЦикла;
КонецПроцедуры

 &НаСервере
 Процедура ДобавитьНачальнуюСтраницуHTML()
 	ДобавитьНачалоHTML();	
 	ДобавитьКонецHTML();
 КонецПроцедуры

 &НаСервере
 Процедура ДобавитьКонецHTML()
 	НоваяСтрока = Объект.Комментарии.Добавить();
 	
 	ТекстКоментария =	"	</body>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "</html>";
 	 
 	НоваяСтрока.Коментарий = ТекстКоментария;
 КонецПроцедуры

 &НаСервере
 Процедура ДобавитьНачалоHTML()
 	НоваяСтрока = Объект.Комментарии.Добавить();
 	
 	ТекстКоментария = "<!DOCTYPE html>"; 
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "<html lang=""ru>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<head>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "		<meta charset=""UTF-8>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "		 <title>" + Объект.Наименование + "</title>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	</head>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<body>";
 	
 	НоваяСтрока.Коментарий = ТекстКоментария; 
 КонецПроцедуры
 
 &НаКлиенте
Процедура ДобавитьФайлы()
		УИД = Новый УникальныйИдентификатор();
	Оповещение  =  Новый ОписаниеОповещения("ОбработатьВыборФайла",   ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,   ,   ,   Истина,   УИД);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат; 
	КонецЕсли;
	
	ОписаниеФайла = Новый Файл(ВыбранноеИмяФайла);
	
	СсылкаНаОбъект = Объект.Ссылка; 
	СохранитьФайлВХранилище(Адрес, СсылкаНаОбъект, ОписаниеФайла.ИмяБезРасширения);	
 	
КонецПроцедуры

&НаСервере
Процедура СохранитьФайлВХранилище(Адрес, Владелец, Имя)

	НовФайл = Справочники.ЛентыФайлы.СоздатьЭлемент();
	НовФайл.ВладелецФайла 		= Владелец;
	НовФайл.Наименование 		= Имя;
	НовФайл.ДатаСоздания 		= ТекущаяДатаСеанса();
	НовФайл.ФайлХранилище 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
	НовФайл.Записать();
	
КонецПроцедуры 
#КонецОбласти