
&НаКлиенте
Процедура ОписаниеФорматированныйТекстПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ПозицияНачала 		= 0;
    ПозицияОкончания 	= 0; 
    ТекстШаблона 		= "";
    ТекстВставки 		= "";
    Вложения 			= Неопределено;
    
    Элементы.ОписаниеФорматированныйТекст.ПолучитьГраницыВыделения(ПозицияНачала, ПозицияОкончания);
    ВыделенныйТекст = ОписаниеФорматированныйТекст.ПолучитьТекст(ПозицияНачала, ПозицияОкончания);
    
    ОписаниеФорматированныйТекст.ПолучитьHTML(ТекстШаблона, Вложения);
    ТекстВставки = "<H2> " + ВыделенныйТекст + "</H2> ";
    ТекстШаблона = СтрЗаменить (ТекстШаблона,ВыделенныйТекст, ТекстВставки);
    
    ИзменитьОписаниеФорматированныйТекст(ТекстШаблона, Вложения);
    
//    ОписаниеФорматированныйТекст.УстановитьHTML(ТекстШаблона, Вложения);
    
//    Если Не ВыделенныйТекст = "" Тогда
//    	ОписаниеФорматированныйТекст.Удалить(ПозицияНачала, ПозицияОкончания); 
//		ОписаниеФорматированныйТекст.Вставить(ПозицияНачала, "<H2> " + ВыделенныйТекст + "</H2> "); 
//    КонецЕсли;

	ОписаниеФорматированныйТекст.ПолучитьHTML(ТекстШаблона, Вложения);	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОписаниеФорматированныйТекст(ТекстШаблона, Вложения)
	ОписаниеФорматированныйТекст.УстановитьHTML(ТекстШаблона, Вложения);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОписаниеФорматированныйТекст=ТекущийОбъект.ОписаниеХранилищеФорматированногоТекста.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ОписаниеХранилищеФорматированногоТекста=Новый ХранилищеЗначения(ОписаниеФорматированныйТекст);
	ТекущийОбъект.Описание=ОписаниеФорматированныйТекст.ПолучитьТекст();
КонецПроцедуры